results/4-nodes/couchbase/workloade_couchbase_custom/log.txt
[OVERALL], RunTime(ms), 137166
[OVERALL], Throughput(ops/sec), 1168.635084496158
[TOTAL_GCS_PS_Scavenge], Count, 100
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1523
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 1.1103334645611886
[TOTAL_GCS_PS_MarkSweep], Count, 1
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 1432
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 1.0439904932709272
[TOTAL_GCs], Count, 101
[TOTAL_GC_TIME], Time(ms), 2955
[TOTAL_GC_TIME_%], Time(%), 2.1543239578321156
[CLEANUP], Operations, 250
[CLEANUP], AverageLatency(us), 0.396
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 7
[CLEANUP], 0, 0.9090909090909091
[CLEANUP], 1000, 0.40816326530612246
[CLEANUP], 2000, 0.36363636363636365
[CLEANUP], 3000, 0.43902439024390244
[CLEANUP], 4000, 0.25
[CLEANUP], 5000, 0.2926829268292683
[CLEANUP], 6000, 0.3333333333333333
[INSERT], Operations, 0
[INSERT], AverageLatency(us), NaN
[INSERT], MinLatency(us), -1
[INSERT], MaxLatency(us), -1
[INSERT], Return=ERROR, 8070
[INSERT], 0, NaN
[SCAN], Operations, 152227
[SCAN], AverageLatency(us), 109733.15871691618
[SCAN], MinLatency(us), 968
[SCAN], MaxLatency(us), 11530829
[SCAN], Return=OK, 152227
[SCAN], 0, 21593.49019607843
[SCAN], 1000, 3841.9008097165993
[SCAN], 2000, 3505.5745062836627
[SCAN], 3000, 3463.7624113475176
[SCAN], 4000, 3537.395306859206
[SCAN], 5000, 3620.856074766355
[SCAN], 6000, 3380.740418118467
[SCAN], 7000, 126049.24277456648
[SCAN], 8000, 1932486.2727915195
[SCAN], 9000, 134361.83867341204
[SCAN], 10000, 133979.31362612612
[SCAN], 11000, 139026.04886363636
[SCAN], 12000, 136543.36810810812
[SCAN], 13000, 142873.2354368932
[SCAN], 14000, 134497.08630609896
[SCAN], 15000, 135222.7611202636
[SCAN], 16000, 132619.0628356606
[SCAN], 17000, 129632.23041997729
[SCAN], 18000, 133603.99945414846
[SCAN], 19000, 135523.68998410174
[SCAN], 20000, 127461.01677489177
[SCAN], 21000, 132777.51708428247
[SCAN], 22000, 143841.10765687967
[SCAN], 23000, 150482.55019556714
[SCAN], 24000, 163067.26482758622
[SCAN], 25000, 143964.5254237288
[SCAN], 26000, 143869.7291268324
[SCAN], 27000, 153170.6093418259
[SCAN], 28000, 147462.91079812206
[SCAN], 29000, 145854.41346153847
[SCAN], 30000, 138565.79612299465
[SCAN], 31000, 141073.74845488256
[SCAN], 32000, 132327.41101928375
[SCAN], 33000, 136327.02964205816
[SCAN], 34000, 134231.91011235956
[SCAN], 35000, 133539.34896110816
[SCAN], 36000, 130347.30364145659
[SCAN], 37000, 131580.64901746725
[SCAN], 38000, 131485.7670424047
[SCAN], 39000, 137917.24568469505
[SCAN], 40000, 147083.87607361964
[SCAN], 41000, 148144.76729559747
[SCAN], 42000, 123960.87406296852
[SCAN], 43000, 107698.46305418719
[SCAN], 44000, 77295.55588452998
[SCAN], 45000, 46446.88581081081
[SCAN], 46000, 15235.770326906957
[SCAN], 47000, 4251.159274193548
[SCAN], 48000, 18692.734534064213
[SCAN], 49000, 27382.886167146975
[SCAN], 50000, 45180.181818181816
[SCAN], 51000, 64339.596960926196
[SCAN], 52000, 76671.58653149892
[SCAN], 53000, 107188.85289514867
[SCAN], 54000, 116980.51225114854
[SCAN], 55000, 115011.62004325884
[SCAN], 56000, 117927.54878943507
[SCAN], 57000, 153831.28818660649
[SCAN], 58000, 136923.46366366366
[SCAN], 59000, 124686.23273273274
[SCAN], 60000, 112981.70532767562
[SCAN], 61000, 108550.72940117064
[SCAN], 62000, 112675.70615671642
[SCAN], 63000, 124828.80096566524
[SCAN], 64000, 131497.59011791128
[SCAN], 65000, 127837.68963414634
[SCAN], 66000, 132322.2294713161
[SCAN], 67000, 133945.25633106855
[SCAN], 68000, 118747.93086109366
[SCAN], 69000, 120499.65416666666
[SCAN], 70000, 118989.23562855338
[SCAN], 71000, 126380.81465247339
[SCAN], 72000, 113358.42586544743
[SCAN], 73000, 103879.75065104167
[SCAN], 74000, 86914.15165562915
[SCAN], 75000, 62806.970657276994
[SCAN], 76000, 25899.73879358052
[SCAN], 77000, 4309.606132075472
[SCAN], 78000, 4400.968421052631
[SCAN], 79000, 5147.356265356266
[SCAN], 80000, 15867.841584158416
[SCAN], 81000, 37171.16338983051
[SCAN], 82000, 45716.178378378376
[SCAN], 83000, 29680.257082152973
[SCAN], 84000, 38837.05488621151
[SCAN], 85000, 61546.20336700336
[SCAN], 86000, 69146.40052356021
[SCAN], 87000, 82179.2170160296
[SCAN], 88000, 47815.01836065574
[SCAN], 89000, 12974.788384512683
[SCAN], 90000, 3662.7181008902076
[SCAN], 91000, 4149.683836589698
[SCAN], 92000, 4192.681912681913
[SCAN], 93000, 4115.2818671454215
[SCAN], 94000, 3617.0416666666665
[SCAN], 95000, 9828.182186234817
[SCAN], 96000, 4382.147887323944
[SCAN], 97000, 3658.1026694045177
[SCAN], 98000, 4087.647564469914
[SCAN], 99000, 4291.701265822785
[SCAN], 100000, 3648.598694942904
[SCAN], 101000, 7036.612202688728
[SCAN], 103000, 10327.99375
[SCAN], 104000, 5664.076923076923
[SCAN], 106000, 4452.074358974359
[SCAN], 107000, 10437.06651108518
[SCAN], 108000, 11160.738823529411
[SCAN], 109000, 4210.521645021645
[SCAN], 110000, 4041.061099796334
[SCAN], 111000, 4292.325456498389
[SCAN], 112000, 3927.125356125356
[SCAN], 113000, 5760.580188679245
[SCAN], 114000, 7478.287522603979
[SCAN], 115000, 4236.820754716981
[SCAN], 116000, 9651.322660098522
[SCAN], 117000, 14312.395145631068
[SCAN], 118000, 4448.664705882353
[SCAN], 119000, 8193.085668534828
[SCAN], 120000, 4208.842900302115
[SCAN], 122000, 6208.122317596567
[SCAN], 123000, 4553.7744680851065
[SCAN], 124000, 5045.647975077882
[INSERT-FAILED], Operations, 8070
[INSERT-FAILED], AverageLatency(us), 1971816.627385378
[INSERT-FAILED], MinLatency(us), 481
[INSERT-FAILED], MaxLatency(us), 17547782
[INSERT-FAILED], 0, 420046.6923076923
[INSERT-FAILED], 1000, 4345.217391304348
[INSERT-FAILED], 2000, 2307.0476190476193
[INSERT-FAILED], 3000, 1255.9310344827586
[INSERT-FAILED], 4000, 1236.92
[INSERT-FAILED], 5000, 1386.1739130434783
[INSERT-FAILED], 6000, 1316.45
[INSERT-FAILED], 7000, 2445993.888888889
[INSERT-FAILED], 8000, 82847.19230769231
[INSERT-FAILED], 9000, 92425.01176470588
[INSERT-FAILED], 10000, 89385.86904761905
[INSERT-FAILED], 11000, 91785.0
[INSERT-FAILED], 12000, 92146.55555555556
[INSERT-FAILED], 13000, 104088.73333333334
[INSERT-FAILED], 14000, 94207.98936170213
[INSERT-FAILED], 15000, 96719.08139534884
[INSERT-FAILED], 16000, 75373.1282051282
[INSERT-FAILED], 17000, 92637.88888888889
[INSERT-FAILED], 18000, 79650.14
[INSERT-FAILED], 19000, 88778.08602150538
[INSERT-FAILED], 20000, 72813.56140350878
[INSERT-FAILED], 21000, 95137.4074074074
[INSERT-FAILED], 22000, 84630.96052631579
[INSERT-FAILED], 23000, 245630.98969072165
[INSERT-FAILED], 24000, 205786.1
[INSERT-FAILED], 25000, 772807.9411764706
[INSERT-FAILED], 26000, 341925.6448598131
[INSERT-FAILED], 27000, 434358.25423728814
[INSERT-FAILED], 28000, 483358.06976744183
[INSERT-FAILED], 29000, 535188.25
[INSERT-FAILED], 30000, 494060.98214285716
[INSERT-FAILED], 31000, 174006.44210526315
[INSERT-FAILED], 32000, 97345.0
[INSERT-FAILED], 33000, 102762.94186046511
[INSERT-FAILED], 34000, 86513.42
[INSERT-FAILED], 35000, 94326.34736842105
[INSERT-FAILED], 36000, 96405.85185185185
[INSERT-FAILED], 37000, 101977.6213592233
[INSERT-FAILED], 38000, 96979.53246753247
[INSERT-FAILED], 39000, 97237.22093023256
[INSERT-FAILED], 40000, 136442.92307692306
[INSERT-FAILED], 41000, 594373.3666666667
[INSERT-FAILED], 42000, 1378899.0869565217
[INSERT-FAILED], 43000, 1067512.9
[INSERT-FAILED], 44000, 2370284.0
[INSERT-FAILED], 45000, 3103398.65625
[INSERT-FAILED], 46000, 719641.2647058824
[INSERT-FAILED], 47000, 2448509.435897436
[INSERT-FAILED], 48000, 4324182.826530612
[INSERT-FAILED], 49000, 2429611.5375
[INSERT-FAILED], 50000, 3001012.0512820515
[INSERT-FAILED], 51000, 2609724.475728155
[INSERT-FAILED], 52000, 2468115.4096385543
[INSERT-FAILED], 53000, 1260072.6041666667
[INSERT-FAILED], 54000, 2108292.234375
[INSERT-FAILED], 55000, 1174763.2631578948
[INSERT-FAILED], 56000, 1201540.1968503937
[INSERT-FAILED], 57000, 406328.7699115044
[INSERT-FAILED], 58000, 259993.99019607843
[INSERT-FAILED], 59000, 76854.55319148937
[INSERT-FAILED], 60000, 73021.61983471074
[INSERT-FAILED], 61000, 72756.27049180328
[INSERT-FAILED], 62000, 77560.93220338984
[INSERT-FAILED], 63000, 116781.46875
[INSERT-FAILED], 64000, 223333.83333333334
[INSERT-FAILED], 65000, 381788.4636363636
[INSERT-FAILED], 66000, 230289.84615384616
[INSERT-FAILED], 67000, 463590.85714285716
[INSERT-FAILED], 68000, 754792.8352941177
[INSERT-FAILED], 69000, 434503.0602409639
[INSERT-FAILED], 70000, 628093.9247311827
[INSERT-FAILED], 71000, 616683.8684210526
[INSERT-FAILED], 72000, 654327.6279069767
[INSERT-FAILED], 73000, 1510064.7741935484
[INSERT-FAILED], 74000, 910712.4411764706
[INSERT-FAILED], 75000, 2699853.170212766
[INSERT-FAILED], 76000, 840034.9756097561
[INSERT-FAILED], 77000, 2210062.85
[INSERT-FAILED], 78000, 3414243.888888889
[INSERT-FAILED], 79000, 4979982.0
[INSERT-FAILED], 80000, 2069890.4173228347
[INSERT-FAILED], 81000, 5059051.4
[INSERT-FAILED], 82000, 3574318.1346153845
[INSERT-FAILED], 83000, 2147453.376237624
[INSERT-FAILED], 84000, 2017607.1574074074
[INSERT-FAILED], 85000, 1958881.7428571428
[INSERT-FAILED], 86000, 2038672.7372262774
[INSERT-FAILED], 87000, 2325980.1071428573
[INSERT-FAILED], 88000, 3830697.5757575757
[INSERT-FAILED], 89000, 796558.90625
[INSERT-FAILED], 90000, 1521427.0
[INSERT-FAILED], 91000, 2751364.9696969697
[INSERT-FAILED], 92000, 3952869.5757575757
[INSERT-FAILED], 93000, 5510492.137931035
[INSERT-FAILED], 94000, 6646325.388888889
[INSERT-FAILED], 95000, 8400975.84
[INSERT-FAILED], 96000, 9491514.935483871
[INSERT-FAILED], 97000, 1.0660099444444444E7
[INSERT-FAILED], 98000, 7033178.954545454
[INSERT-FAILED], 99000, 2395564.5789473685
[INSERT-FAILED], 100000, 3938748.96875
[INSERT-FAILED], 101000, 6804047.173076923
[INSERT-FAILED], 103000, 1.0932596969696969E7
[INSERT-FAILED], 104000, 1.252403803125E7
[INSERT-FAILED], 106000, 1.5916164935483871E7
[INSERT-FAILED], 107000, 6235555.48
[INSERT-FAILED], 108000, 5563060.24
[INSERT-FAILED], 109000, 8206533.935483871
[INSERT-FAILED], 110000, 1.032303452173913E7
[INSERT-FAILED], 111000, 8601072.75
[INSERT-FAILED], 112000, 1896836.705882353
[INSERT-FAILED], 113000, 4664554.674418605
[INSERT-FAILED], 114000, 5467442.111111111
[INSERT-FAILED], 115000, 7077772.0
[INSERT-FAILED], 116000, 8593795.744680852
[INSERT-FAILED], 117000, 9137303.111111112
[INSERT-FAILED], 118000, 1.06493454E7
[INSERT-FAILED], 119000, 3759024.7321428573
[INSERT-FAILED], 120000, 3395488.222222222
[INSERT-FAILED], 122000, 6388353.0566037735
[INSERT-FAILED], 123000, 9181361.954545455
[INSERT-FAILED], 124000, 1.077918240625E7
[INSERT-FAILED], 125000, 1.30696428E7
[INSERT-FAILED], 126000, 1.3580888969696969E7
[INSERT-FAILED], 127000, 4176971.277777778
[INSERT-FAILED], 128000, 6347647.519230769
[INSERT-FAILED], 129000, 9656664.644444445
[INSERT-FAILED], 130000, 1.10697595E7